[
    {
       "id": "1",
       "title": "ORIENTATION SESSION OF THE CLUB",
       "platform": "MS Teams",
       "date": "6th March 2022",
       "description": "The orientation session of the club was conducted as an introductory program for the club. It aimed at letting students know the primary objective of forming the club and about its various aims. It inspired hundreds of students to join out.",
       "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/orientation.webp"
    },
    {
        "id": "2",
        "title": "14_DAYS_OF_CODE",
        "platform": "Online mode",
        "date": "13th to 27th March 2022",
        "description": "OS Code conducted 14-days of planned sessions for the ones having passion in programming and coding. It aimed at covering the basic Coding topics through a 14 days plan in languages like C++, Java and Python. The session was open to all inquisitive engineers who had a desire to master programming.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/14daysofcode.webp"
     },
     {
        "id": "3",
        "title": "HUSTLE #1",
        "platform": "HackerRank",
        "date": "10th April 2022",
        "description": "Another captivating event conducted by OS Code is “HUSTLE”. Hustle is a monthly coding contest organized by team OS code to polish and level up the competitive programming skills of the students. It aims at making the students familiar with various data structures and algorithms concepts, the fundamentals of logical and critical thinking, and how to approach a CP based question. Hustle 1 proved to be a great success involving around 150 registrations, 80+ active participants with majority being from CSE and ISE.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/HUSTLE_1.webp"
     },
     {
        "id": "4",
        "title": "HUSTLE #2",
        "platform": "HackerRank",
        "date": "30th May 2022",
        "description": "After the great response from hustle #1, Hustle 1 proved to be no less. There were 75+ active participants.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/HUSTLE_2.webp"
     },
     {
        "id": "5",
        "title": "WALKATHON",
        "platform": "Kittur Rani Chennamma Stadium",
        "date": "16th June 2022",
        "description": "The Walk-a-thon was organized to support the cause of nature conservation and regarding saving the soil. It witnessed huge participation.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/walkathon.webp"
     },
     {
        "id": "6",
        "title": "BUBBLE WRESTLING (Manthan Event)",
        "platform": "Bangalore Institute of Technology",
        "date": "22nd and 23rd June 2022",
        "description": "Team OS code organized mind blowing events in BIT's annual Techno-Cultural Fest, Manthan 2022. The objective of this event was to conduct an enthralling event aimed at entertaining students, ensuring maximum participation, and creating an environment of fun, joy and competition. This event proved to be the most successful event of all the Manthan events.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/bubble_wrestling.webp"
     },
     {
        "id": "7",
        "title": "RC CAR RACE (Manthan Event)",
        "platform": "Bangalore Institute of Technology",
        "date": "22nd and 23rd June 2022",
        "description": "RC - Car race was one of the technical events in Manthan'22. First day of the event witnessed several races including a final one , specifically organised to decide a winner and a runner-up among the top 5 participants. On the second day, the winner was declared and received a cash prize of RS.2000, while the runner up received Rs.1000 as price money.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/RC_car_race.webp"
     },
     {
        "id": "8",
        "title": "CRACK THE CODE (Manthan Event)",
        "platform": "Bangalore Institute of Technology",
        "date": "22nd and 23rd June 2022",
        "description": "The objective of the event was to crack the given locks (in the from of password protected PDFs) and proceed forward with each level. The duration of the event was 50 minutes. The winner was decided on the basis of fastest team to crack all the locks and get to the WINNING page.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/crack_the_code.webp"
     },
     {
        "id": "9",
        "title": "HUSTLE #3",
        "platform": "Bangalore Institute of Technology",
        "date": "30th June 2022",
        "description": "The 3rd sequel of HUSTLE was organized on 30th June 22 on Hacker Rank platform from 9:00 pm to 11:00 pm with exciting prizes for the winners- 1st position was bagged by Rajveer Singh Bharadwaj of 2nd year CSE who received a Wireless Mouse as the prize. 1st position among 1st year was bagged by Abhijit Laxman Shirwal of CSE who received a temperature display water bottle as the prize !",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/hustle_3.webp"
     },
     {
        "id": "10",
        "title": "HUSTLE #4",
        "platform": "HackerRank",
        "date": "30th July 2022",
        "description": "Hustle #4 was conducted on 30th July 22 on Hacker Rank platform from 9-11 pm with - Rajveer Singh Bharadwaj (2nd year CSE) emerging as the winner and Anusha Kulkari (3rd year CSE)  holding the 2nd position.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/hustle_4.webp"
     },
     {
        "id": "11",
        "title": "OPEN SOURCE - THE FOUNDATION STONE",
        "platform": "Bangalore Institute of Technology",
        "date": "20th August 2022",
        "description": "OS-CODE club presents its flagship event, an interactive and infomative session on 'Introduction to Open SOurce and Github'. The speakers were - 1. HARSH (President of OS-Code, who cleared GSOC in his 1st year of engineering), 2. MAYANK SHAHI (Experienced in open source and competitive coding and also an upcoming intern at Fidelity Investments), 3. Sudhanshu Shekhar (Proficient web developer and Smart India Hackathon winner). This event turned out to be a great success with peak participation of more than 200 people. It remained extremely informative and ever inspiring without compromising on the fun and humour component.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/foundation_stone.webp"
     },
     {
        "id": "12",
        "title": "HUSTLE #5",
        "platform": "HackerRank",
        "date": "21st August 2022",
        "description": "OS-Code's 5th edition of HUSTLE was an intensive programming contest which tested the problem solving skills along with logical reasoning.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/Hustle_5-Poster.webp"
     },
     {
        "id": "13",
        "title": "KING OF THE 64",
        "platform": "Lichess",
        "date": "16th October 2022",
        "description": "This was an event conducted by OS-CODE to test the skills of all Elite Chess Players. The tournament was conducted on lichess. We saw huge participation from students and overall the event was a success.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/king64.webp"
     },
     {
        "id": "14",
        "title": "UPSTART 2022",
        "platform": "Bangalore Institute of Technology",
        "date": "19th November 2022",
        "description": "The speaker was Ananya Shetty, who has helped 60+ companies be the boldest, most colorful, vibrant expressions of who they are in the digital space. Currently, she is the founder of Zenoholics, a branding agency that empowers entrepreneurs by building businesses. Speaker started her talk explaining two fundamental traits in entrepreneurship: 1.Innate curiosity 2.Action taker. Then she continued elaborating on two kinds of products and Taking pivot which is an important part of entrepreneurship.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/upstart.webp"
     },
     {
        "id": "15",
        "title": "INDUCTION PROGRAM",
        "platform": "Bangalore Institute of Technology",
        "date": "7th December 2022",
        "description": "Student Induction Program 2022-23 mainly focussed the newly joined buddies to help them know about OS-Code club. It aimed at letting students know the primary objective of forming the club and about its various aims. It inspired hundreds of students to join out",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/induction_program.webp"
     },
     {
        "id": "16",
        "title": "TREASURE HUNT (FUNATHON)",
        "platform": "Bangalore Institute of Technology",
        "date": "29th December 2022",
        "description": "FUNATHON is the non technical event conducted by OS CODE Club of Bangalore Institute of Technology.Treasure Hunt is a game in which players follow sequential clues in search of a prize or prizes. It was a team game where each member should solve the given puzzle, crack the puzzle and final answer would lead them to a place. The team which cracks first, and which reaches the destination first will win the game.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/treasure_hunt.webp"
     },
     {
        "id": "17",
        "title": "TUG OF WAR (FUNATHON)",
        "platform": "Bangalore Institute of Technology",
        "date": "29th December 2022",
        "description": "FUNATHON is the non technical event conducted by OS CODE Club of Bangalore Institute of Technology. Tug of war (also known as tug o' war, tug war, rope war, rope pulling, or tugging war) is a sport that pits two teams against each other in a test of strength: teams pull on opposite ends of a rope, with the goal being to bring the rope a certain distance in one direction against the force of the opposing team's pull.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/tug_of_war.webp"
     },
     {
        "id": "18",
        "title": "DUMB CHARADES (FUNATHON)",
        "platform": "Bangalore Institute of Technology",
        "date": "29th December 2022",
        "description": "Dumb Charades is a simliar to a guessing game. One member of the team is given a word which maybe a movie name, a novel name or a popular place ,he/she is supposed to enact it to their group without uttering a single word. The team members should keep on guesssing for the right answer within the given time constraints. If the team guesses the correct answer within the given time then, that team would gain a point.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/dumb_charades.webp"
     },
     {
        "id": "19",
        "title": "MUSICAL CHAIR (FUNATHON)",
        "platform": "Bangalore Institute of Technology",
        "date": "29th December 2022",
        "description": "Musical chairs is a game of elimination involving players, chairs, and music. It is a game where individual players compete against each other to get themselves a seat when music stops while revolving in circle around the chairs. The player who secures himself/herself the last chair after every stage of a round goes to the final round where the winner is decided.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/musical_chairs.webp"
     },
     {
        "id": "20",
        "title": "ARM WRESTLING (FUNATHON)",
        "platform": "Bangalore Institute of Technology",
        "date": "29th December 2022",
        "description": "ARM Wrestling was the event which mainly aimed at attracting the zealous individuals from BIT. Not solely concentrated on arm strength, its about 50% strength and 50% technique which often makes the weaker one defeat the stronger. So yeah, the result is obvious but still not obvious!! Though conducted in parallel with four other events, this event reported huge number of participants, with majority being males. Although the female participant was anticipated to be null, the event also witnessed a good number of female participants. Overall, the event was a great success!",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/arm_wrestling.webp"
     },
     {
        "id": "21",
        "title": "7_DAYS_OF_CODE",
        "platform": "Online mode",
        "date": "5th to 12th February 2023",
        "description": "7daysofcode is OS-Code's latest coding endeavour, which joins fellow coders on this journey to enhance their skills and improve their expertise. Students were provided with proficient mentors to help them through their difficulties. Resources were provided for their respective domains to aid learning proocess. Quiz was conducted at the end to assess their progress.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/7daysofcode.webp"
     },
     {
        "id": "22",
        "title": "HUSTLE #6",
        "platform": "HackerRank",
        "date": "12th February 2023",
        "description": "Hustle #6 was conducted on 12th February 2023 on Hacker Rank platform from 9-11 pm with - Garvit Saraf emerging as the winner from 2nd year CSE and Prince Kumar Gupta holding the 1st position from 1st year CSE.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/hustle_6.webp"
     },
     {
        "id": "23",
        "title": "HUSTLE #7",
        "platform": "Codechef",
        "date": "26th March 2023",
        "description": "OS-CODE's 7th edition of HUSTLE with Platform Partner CODECHEF! shows off problem-solving skills and logical reasoning.",
        "image": "https://raw.githubusercontent.com/akshathar-navada/oscode-images/main/hustle7.webp"
     }
]
