[
    {
       "id": "1",
       "title": "ORIENTATION SESSION OF THE CLUB",
       "platform": "MS Teams",
       "date": "6th March 2022",
       "description": "The orientation session of the club was conducted as an introductory program for the club. It aimed at letting students know the primary objective of forming the club and about its various aims. It inspired hundreds of students to join out.",
       "image": "https://drive.google.com/uc?export=download&id=1YrGxrE0weoZHd0P-vCvIIOWKFLb4ADXB"
    },
    {
        "id": "2",
        "title": "14 DAYS OF CODE",
        "platform": "Online mode",
        "date": "13th to 27th March 2022",
        "description": "OS Code conducted 14 days of planned sessions for the ones having a passion for programming and coding. It aimed at covering the basic Coding topics through a 14 days plan in languages like C++, Java, and Python. The session was open to all inquisitive engineers who had the desire to master programming.",
        "image": "https://drive.google.com/uc?export=download&id=1phU5vid0-AfJcR2yRLArFZcGEsC0A6Og"
     },
     {
        "id": "3",
        "title": "HUSTLE #1",
        "platform": "HackerRank",
        "date": "10th April 2022",
        "description": "Hustle aims at making the students familiar with various data structures and algorithms concepts, the fundamentals of logical and critical thinking, and how to approach a CP based question. Hustle 1 proved to be a great success involving around 150 registrations, 80+ active participants with majority being from CSE and ISE.",
        "image": "https://drive.google.com/uc?export=download&id=1Hy2ifp0aEetkx3si4FYjpoeM2GQPHSHI"
     },
     {
        "id": "4",
        "title": "HUSTLE #2",
        "platform": "HackerRank",
        "date": "30th May 2022",
        "description": "After the great response from hustle #1, Hustle 1 proved to be no less. There were 75+ active participants. We'll be back with many more events and contests. Stay tuned!!",
        "image": "https://drive.google.com/uc?export=download&id=1JdrYFLRbfLneDqVwbS3UhZBnATT9J5yS"
     },
     {
        "id": "5",
        "title": "WALKATHON",
        "platform": "Kittur Rani Chennamma Stadium",
        "date": "16th June 2022",
        "description": "The Walk-a-thon was organized to support the cause of nature conservation and  saving the soil. To support this wonderful initiative, we joined the walk-a-thon organized by BIT with the theme of 'SAVE MOTHER NATURE'. It witnessed huge participation.",
        "image": "https://drive.google.com/uc?export=download&id=1fQDMG2Mv245SlVOfN_74C9j_tZgQ9K8O"
     },
     {
        "id": "6",
        "title": "BUBBLE WRESTLING (Manthan Event)",
        "platform": "Bangalore Institute of Technology",
        "date": "22nd and 23rd June 2022",
        "description": "The objective of the event was to conduct an enthralling event aimed at entertaining students, ensuring maximum participation, and creating an environment of fun, joy, and competition. This event proved to be the most successful event of all the Manthan events.",
        "image": "https://drive.google.com/uc?export=download&id=1pnguiEHTFokgnIHo9lkWqwwpVeLcKHSL"
     },
     {
        "id": "7",
        "title": "RC CAR RACE (Manthan Event)",
        "platform": "Bangalore Institute of Technology",
        "date": "22nd and 23rd June 2022",
        "description": "RC - Car race was one of the technical events in Manthan'22.The first day of the event witnessed several races including a final one , specifically organized to decide a winner and a runner-up among the top 5 participants. On the second day, the winner was declared and received a cash prize of Rs.2000, while the runner-up received Rs.1000 as price money.",
        "image": "https://drive.google.com/uc?export=download&id=1rQ_z1pfGCdMcgE438vf_PT2Mik-mPFX4"
     },
     {
        "id": "8",
        "title": "CRACK THE CODE (Manthan Event)",
        "platform": "Bangalore Institute of Technology",
        "date": "22nd and 23rd June 2022",
        "description": "Team OS code organized mind-blowing events in BIT's annual Techno-Cultural Fest, Manthan 2022. The objective of this event was to crack the given locks (in the form of password-protected PDFs) and proceed forward with each level. The duration of the event was 50 minutes. The winner was decided on the basis of the fastest team to crack all the locks and get to the WINNING page.",
        "image": "https://drive.google.com/uc?export=download&id=1XCki7HGacmzaL41tCKrYlQXbcRO1FhLf"
     },
     {
        "id": "9",
        "title": "HUSTLE #3",
        "platform": "Bangalore Institute of Technology",
        "date": "30th June 2022",
        "description": "The 3rd sequel of HUSTLE was organized with exciting prizes for the winners- 1st position was bagged by Rajveer Singh Bharadwaj of 2nd year CSE who received a Wireless Mouse as the prize. 1st position among 1st year was bagged by Abhijit Laxman Shirwal of CSE who received a temperature display water bottle as the prize !",
        "image": "https://drive.google.com/uc?export=download&id=1CONnadSlBzLlkh_PwWriZEbUTqgElQ_o"
     },
     {
        "id": "10",
        "title": "HUSTLE #4",
        "platform": "HackerRank",
        "date": "30th July 2022",
        "description": "Hustle #4 was conducted on 30th July 22 on the Hacker Rank platform from 9-11 pm with - Rajveer Singh Bharadwaj (2nd year CSE) emerging as the winner and Anusha Kulkari (3rd year CSE)  holding the 2nd position.",
        "image": "https://drive.google.com/uc?export=download&id=1qVo4sHy3yQvXiwypY7XSgxax9PmHHUBw"
     },
     {
        "id": "11",
        "title": "OPEN SOURCE - THE FOUNDATION STONE",
        "platform": "Bangalore Institute of Technology",
        "date": "20th August 2022",
        "description": "OS-CODE club presents its flagship event, an interactive and  informative session on 'Introduction to Open Source and Github'. This event turned out to be a great success with a peak participation of more than 200 people. It remained extremely informative and ever-inspiring without compromising on the fun and humor component.",
        "image": "https://drive.google.com/uc?export=download&id=1cAVZw2vqY20kUYfAzHDfaZqu_blM7TsG"
     },
     {
        "id": "12",
        "title": "HUSTLE #5",
        "platform": "HackerRank",
        "date": "21st August 2022",
        "description": "OS-Code's 5th edition of HUSTLE was an intensive programming contest which tested the problem solving skills along with logical reasoning.",
        "image": "https://drive.google.com/uc?export=download&id=1XLVDRTAPrqX9LnXdUExBD-OevGKf4Gr9"
     },
     {
        "id": "13",
        "title": "KING OF THE 64",
        "platform": "Lichess",
        "date": "16th October 2022",
        "description": "This was an event conducted by OS-CODE to test the skills of all Elite Chess Players. The tournament was conducted on lichess. We saw huge participation from students and overall the event was a success.",
        "image": "https://drive.google.com/uc?export=download&id=18e73qwVxlRBAmBTibQx4yaUW3W4_ODeI"
     },
     {
        "id": "14",
        "title": "UPSTART 2022",
        "platform": "Bangalore Institute of Technology",
        "date": "19th November 2022",
        "description": "The speaker was Ananya Shetty, who has helped 60+ companies be the boldest, most colorful, vibrant expressions of who they are in the digital space. Currently, she is the founder of Zenoholics, a branding agency that empowers entrepreneurs by building businesses.",
        "image": "https://drive.google.com/uc?export=download&id=1kwQIr6WQPYuDCUFY-1c0_9Jg-bfvGDDx"
     },
     {
        "id": "15",
        "title": "INDUCTION PROGRAM",
        "platform": "Bangalore Institute of Technology",
        "date": "7th December 2022",
        "description": "Student Induction Program 2022-23 mainly focussed on the newly joined buddies to help them know about OS-Code club. It aimed at letting students know the primary objective of forming the club and about its various aims. It inspired hundreds of students to join out",
        "image": "https://drive.google.com/uc?export=download&id=1bMXTlFwPv64RZo-7CVticjHipnVQ0MOk"
     },
     {
        "id": "16",
        "title": "TREASURE HUNT (FUNATHON)",
        "platform": "Bangalore Institute of Technology",
        "date": "29th December 2022",
        "description": "Treasure Hunt is a game in which players follow sequential clues in search of a prize or prizes. It was a team game where each member should solve the given puzzle, crack the puzzle and the final answer would lead them to a place. The team which cracks first, and  reaches the destination first will win the game.",
        "image": "https://drive.google.com/uc?export=download&id=14W6uyZ-7y8AlBK3G3Z16ZaJtazaVoHxn"
     },
     {
        "id": "17",
        "title": "TUG OF WAR (FUNATHON)",
        "platform": "Bangalore Institute of Technology",
        "date": "29th December 2022",
        "description": "Tug of war is a sport that pits two teams against each other in a test of strength: teams pull on opposite ends of a rope, with the goal being to bring the rope a certain distance in one direction against the force of the opposing team's pull.",
        "image": "https://drive.google.com/uc?export=download&id=1nIuyBM1hS2mLUO7Tgfq2Oq40eZ5MordA"
     },
     {
        "id": "18",
        "title": "DUMB CHARADES (FUNATHON)",
        "platform": "Bangalore Institute of Technology",
        "date": "29th December 2022",
        "description": "Dumb Charade is similar  to a guessing game. One member of the team is given a word which may be a movie name, a novel name or a popular place, he/she is supposed to enact it to their group without uttering a single word. If the team guesses the correct answer within the given time then, that team would gain a point.",
        "image": "https://drive.google.com/uc?export=download&id=13z8B0CgtXvNT6nEodByKkrVmMINYjpiM"
     },
     {
        "id": "19",
        "title": "MUSICAL CHAIR (FUNATHON)",
        "platform": "Bangalore Institute of Technology",
        "date": "29th December 2022",
        "description": "Musical chairs is a game of elimination involving players, chairs, and music. It is a game where individual players compete against each other to get themselves a seat when the music stops while revolving in a circle around the chairs. The player who secures himself/herself the last chair after every stage of a round goes to the final round where the winner is decided.",
        "image": "https://drive.google.com/uc?export=download&id=1Hly3tllnXl5t0igbn05BeLnm2kHFwiFd"
     },
     {
        "id": "20",
        "title": "ARM WRESTLING (FUNATHON)",
        "platform": "Bangalore Institute of Technology",
        "date": "29th December 2022",
        "description": "FUNATHON is the non technical event conducted by OS CODE Club of Bangalore Institute of Technology. ARM Wrestling was the event that mainly aimed at attracting  zealous individuals from BIT. Not solely concentrated on arm strength, it's about 50% strength and 50% technique which often makes the weaker one defeat the stronger.",
        "image": "https://drive.google.com/uc?export=download&id=15_SQxK7cIR9qYTiT__yxwmPc8w0Y6umC"
     },
     {
        "id": "21",
        "title": "7 DAYS OF CODE",
        "platform": "Online mode",
        "date": "5th to 12th February 2023",
        "description": "7 days of Code is OS-Code's latest coding endeavour, which joins fellow coders on this journey to enhance their skills and improve their expertise. Students were provided with proficient mentors to help them through their difficulties. Resources were provided for their respective domains to aid learning processes. Quiz was conducted at the end to assess their progress.",
        "image": "https://drive.google.com/uc?export=download&id=1qxyRG8lPieEhfDK6M3YBscHykM1jEvdc"
     },
     {
        "id": "22",
        "title": "HUSTLE #6",
        "platform": "HackerRank",
        "date": "12th February 2023",
        "description": "Hustle #6 was conducted on 12th February 2023 on Hacker Rank platform from 9-11 pm with - Garvit Saraf emerging as the winner from 2nd year CSE and Prince Kumar Gupta holding the 1st position from 1st year CSE.",
        "image": "https://drive.google.com/uc?export=download&id=1hdYYOGYu0e8-Ne2hwDL6LKSSDg1nyT8l"
     },
     {
        "id": "23",
        "title": "HUSTLE #7",
        "platform": "Codechef",
        "date": "26th March 2023",
        "description": "The captivating event conducted by OS Code is “HUSTLE”. Hustle is a monthly coding contest organized by team OS code to polish and level up the competitive programming skills of the students. OS-CODE's 7th edition of HUSTLE with Platform Partner CODECHEF! shows off problem-solving skills and logical reasoning. We thank and appreciate all the participants for making this event a success.",
        "image": "https://drive.google.com/uc?export=download&id=1Jvw70OAJzX9iWz7Iurv3t35cSD2Teiz5"
     },
     {
      "id": "24",
        "title": "LANDING YOUR FIRST REMOTE OPEN SOURCE JOB : A GUIDE FOR BEGINNERS",
        "platform": "Kuvempu Auditorium,REVA University",
        "date": "29th November 2023",
        "description": "Join us for an exciting tech talk on the power of open source and kickstart your journey to a Remote Open Source job! 🌐 Dive into insightful discussions, network with tech enthusiasts, and find inspiration to fuel your passion. Mark your calendars for an epic experience filled with knowledge, connections, and career possibilities. Don't miss out – this is your ticket to a dynamic tech future! 💡💻 ",
        "image": "https://drive.google.com/uc?export=download&id=11PZ4oXRVgnEepJ00JJ5w9ZIKYEJVRi6H"
     }
]
